<?php 

include_once 'db_helper.php';


global $connection;
	
OpenConnection();



$query = "INSERT INTO `News` (`EventDate`, `Title`, `Link`) 
VALUES ('2013-01-14', 'Голова СФУЛО Софія Федина стала лауреатом премії імені Василя Стуса', 'FedynaLaureatStusa.doc'),
('2013-02-11', '​​​​Відійшов у вічність Стефан Хованський - Голова 2-Відділу ООЛ у США, Голова Фундації Досліджень Лемківщини у США', 'SHowOb_UKI.pdf'),
('2013-07-22', 'Заява СФУЛО у відповідь на інформацію, що з’явилася у ЗМІ у зв’язку з проведенням світових конгресів русинів в Україні та Румунії', 'Zayava_SFULO13.pdf'); ";

mysql_query($query, $connection);







$query = "INSERT INTO `History` (`Title`, `Text`, `Type`) 
VALUES ('Світова Федерація Лемків (скор. СФЛ)', 'У 1932 р. при товаристві „Просвіта” у Львові повстала спеціальна Лемківська Комісія, завданням якої було нав\'язати зв\'язки з лемківською громадою в Америці та зацікавити її долею Лемківщини. Організоване життя лемків у Західній діяспорі почалося із 13-особового „Комітету Оборони Лемків”, створеного 3 жовтня 1933р. в Нью-Йорку. Відтак Комітет 4 серпня 1935 р. започаткував Організацію Оборони Лемківщини (скор. ООЛ) – світову спільноту лемків. Перший лемківський з\'їзд відбувся 6 червня 1936 р. у Філядельфії. У 1973 р. з ініціативи ООЛ у США створена СФЛ. До її складу також увійшло Об\'єднання Лемків Канади (створ. 24.03.1973 р.). У 1979 р. створена Фундація Дослідження Лемківщини (скор. ФДЛ) в США. 7 листопада 1981 р. в м. Стемфорд (США) відкрито Український Лемківський Музей.
У 1997 р. СФЛ перейменована на Світову Федерацію Українських Лемківських Об”єднань (скор. СФУЛО). Федерація об\'єднує автохтонних лемків-русинів-українців Польщі, України, Словаччини, а також вихідців із Лемківщини в Хорватії, Сербії, США і Канаді. Програмною метою Федерації є етнічне відродження Лемківщини, збереження, розвиток і популяризація самобутньої духовної і матеріальної історії та культури лемків – етнографічної групи українського народу, на теренах історичної Батьківщини і в країнах їх проживання.
Відомо, що до 1939 р. чисельність лемків-русинів у світі сягала близько 1 623 000 осіб, у т.ч. Закарпаття – 640 тис., США і Канада – 620 тис., Польща – 140 тис., Словаччина – 130 тис.', 1),
('Друковані органи СФЛ', 'Лемківську пресу в еміґрації започаткував часопис „Лемківщина” у Нью-Йорку (1922-28 рр.). Відтак його продовжували: місячник „Лемківський Дзвін” у Філядельфії (1936-39 рр., ред. Михайло Дудра), двотижневик „Лемківщина” у Торонто (1949-53 рр., ред. Юліян Тарнович), місячник „Лемківські Вісті” у Торонто (1958-79 рр., ред. С.Женецький), місячник „Лемковина” у Йонкерсі (1971-81 рр., ред. С.Кичура).
Від 1974 р. у Торонто (Канада) виходять „Аннали Світової Федерації Лемків” (згодом – „Аннали Лемківщини”), редактор яких проф. Іван Гвозда.
Від 1979 р в Кліфтоні (США) виходить журнал-квартальник Організації Оборони Лемківщини в Америці (ред. У.Любович, О.Питляр, П.Матіяшек, М.Дупляк), який став спадкоємцем „Лемківських Вістей”. Метою журналу є „відродження і збереження Лемківщини - західного бастіону України”.', 1);";

mysql_query($query, $connection);



$query = "INSERT INTO `Links` (`Title`, `Link`, `Type` ) 
VALUES ('Олег Панькевич: \"Польща повинна визнати акцію \"Вісла\" етноцидом українців\"​', 'http://www.svoboda.org.ua/diyalnist/novyny/038724/', 1); ";

mysql_query($query, $connection);






$query = "INSERT INTO `Documents` (`Title`, `Name`, `Type` ) 
VALUES ('#1 - ​​​Січень 2013​', 'Wisnyk_1.pdf', 2);";

mysql_query($query, $connection);

$query = "INSERT INTO `Documents` (`Title`, `Name`, `Type` ) 
VALUES ('#2 - ​​​Лютий 2013​', 'Wisnyk_2.pdf', 2);";

mysql_query($query, $connection);

$query = "INSERT INTO `Documents` (`Title`, `Name`, `Type` ) 
VALUES ('#3 - ​​​Березень 2013​', 'Wisnyk_3.pdf', 2);";

mysql_query($query, $connection);

$query = "INSERT INTO `Documents` (`Title`, `Name`, `Type` ) 
VALUES ('#4 - ​​​Квітень 2013​', 'Wisnyk_4.pdf', 2);";

mysql_query($query, $connection);

$query = "INSERT INTO `Documents` (`Title`, `Name`, `Type` ) 
VALUES ('#5 - ​​​Травень 2013​', 'Wisnyk_5.pdf', 2);";

mysql_query($query, $connection);

$query = "INSERT INTO `Documents` (`Title`, `Name`, `Type` ) 
VALUES ('#6 - ​​​Червень 2013​', 'Wisnyk_6.pdf', 2);";

mysql_query($query, $connection);

$query = "INSERT INTO `Documents` (`Title`, `Name`, `Type` ) 
VALUES ('#7 - ​​Липень 2013​', 'Wisnyk_7.pdf', 2);";

mysql_query($query, $connection);

$query = "INSERT INTO `Documents` (`Title`, `Name`, `Type` ) 
VALUES ('#8 - Серпень 2013​', 'Wisnyk_8.pdf', 2); ";

mysql_query($query, $connection);


$query = "INSERT INTO `Documents` (`Title`, `Name`, `Type` ) 
VALUES ('Deportacyjna akcja „Wisła”  Istota i skala problemu. Gorlice, 2007​​', 'Deportacyjna akcja Wisła.pdf', 1);";

mysql_query($query, $connection);


$query = "INSERT INTO `Documents` (`Title`, `Name`, `Type` ) 
VALUES ('Заява СФУЛО у відповідь на інформацію, що з’явилася у ЗМІ у зв’язку з проведенням світових конгресів русинів в Україні та Румунії', 'Zayava_SFULO13.pdf', 3);";

mysql_query($query, $connection);



$query = "INSERT INTO `History` (`Title`, `Text`, `Type`) 
VALUES ('I-й Конґрес СФЛ  (8-10 жовтня 1993 р)', 'Відбувся  у Львові в актовому залі Політехнічного інституту. До Федерації приєдналися Об”єднання Лемків Польщі, Союз Русинів-Українців Словаччини і Товариство „Лемківщина” в Україні (співголови В.Барна, С.Криницький, О.Чабан). У засіданнях Конґресу взяли участь 63 делегати з України, Польщі, Словаччини, США і Канади, а також 474 гості. Привітання Конґресові надіслали Глава УГКЦ Кардинал Любачівський, Президент України Леонід Кравчук, Віце-прем”єр-міністр України Микола Жулинський, Міністр культури України Іван Дзюба, Міністр України в справах національностей та міґрації Олександр Ємець, Голова Комісії Верховної Ради України, поет Дмитро Павличко. 
Світовий Конґрес відкрив проф. Орест Чабан, який запросив вести зібрання проф. Івана Гвозду. Після процедурної частини заслухано та обговорено звіти Голови СФЛ Івана Гвозди та секретаря Івана Терефенка. Фінансовий звіт Контрольної Комісії оголосив Теодор Колос із Торонто. Михайло Ковальський (Польща) інформував про прийняту ними „Програму діяльности та ідейно-організаційних зусиль Об\'єднання Лемків Польщі для відродження Лемківщини”. Із доповідями виступили: голова Організації Оборони Лемківщини в США Марія Дупляк (співдоповіді – В.Кікта, С.Гованський), голови Об\'єднання Лемків Канади Іван Оленич, Союзу Русинів-Українців Словаччини Віктор Коваль, Фундації Дослідження Лемківщини Мирон Мицьо. Обрано керівні органи СФЛ: голова - проф. Іван Гвозда, заступники – Марія Дупляк (США) на Америку, Орест Чабан (Україна) на Європу, Президія - у кількості 14 осіб, Контрольна комісія – сім осіб. 
Обговорено програмні завдання і прийнято нову редакцію Статуту. Прийнято Заяву „Про політичне русинство”, Звернення до Президента Республіки Польща Леха Валенси та Президента України Леоніда Кравчука, Резолюцію. Заслухано наукові доповіді д-ра Юрія Гошка (Львів) „Дослідження на сучасному етапі” та д-ра Олекси Мишанича (Київ) „Політичне русинство і що за ним?” На закінчення проф. І.Гвозда виступив із підсумковою доповіддю „До програмових засад СФЛ”. Після цього відбувся великий концерт професійних і аматорських мистецьких колективів трьох областей Галичини. 
У неділю, 10 жовтня делегати Конґресу поклали квіти на могили Б.І.Антонича, І.Франка та В.Івасюка на Личаківському цвинтарі. У Лемківській церкві в Шевченківському Гаю відбулося Богослужіння і віче на площі біля церкви. Проповідь виголосив отець-митрат Стефан Дзюбина з Перемишля (Польща). ', 2),
	('II-й Конґрес СФЛ  (8-10 серпня 1997 р)', 'Проходив  у Львові в актовому залі Державного університету „Львівська Політехніка”. Напередодні, 7 серпня проводилася нарада делегатів лемківських об\'єднань з питань проведення Конґресу та позачергове засідання Президії СФЛ. 
8 серпня урочисто відкрито Конґрес. Обрано керівні органи: президія, секретаріат, робочі комісії – мандатна, лічильна, резолюційна. Зі звітом про роботу Головної Управи СФЛ виступив проф. Іван Гвозда. Звіт Контрольної комісії оголосив Володимир Кікта (США). Зі звітами-доповідями виступали голови - Василь Шлянта (Об\'єднання Лемків Польщі), Марія Дупляк (Організація Оборони Лемківщини), Іван Оленич (Об\'єднання Лемків Канади), Павло Богдан (Союз Русинів-Українців Словаччини), Мирослав Кіш (Союз Русинів-Українців Хорватії). Від товариства „Лемківщина” в Україні виступили проф. Іван Щерба (Львів), доц. Степан Криницький(Івано-Франківськ) і Олександр Венгринович (Тернопіль). 
9 серпня продовжувалися виступи учасників Конґресу та наукові доповіді про депортаційні процеси й акцію „Вісла” на Лемківщині. Змінена дотеперішня назва „Світова Федерація Лемків” на - „Світова Федерація Українських Лем-ківських Об\'єднань” як така, що краще відображає суть громадської організації. Головою СФУЛО обраний Теодозій Старак (перший посол України в Польщі), почесним головою - проф. Іван Гвозда. Заступниками голови стали Марія Дупляк (США) і Олександр Маслей (Польща). Обрано новий склад Президії Федерації та Контрольної Комісії (голова Ю.Френчко). Прийнято Ухвалу Конґресу, Звернення до Президента і Верховної Ради України, Президента і Сейму Республіки Польща, керівників інших держав, в яких проживають лемки-українці. Новообраній Президії доручено опрацювати Програму Федерації, сформувати матеріальну базу і редакційно-видавничу групу для видання друкованого органу. Після закриття Конґресу проведена прес-конференція і відбувся святковий концерт. 
10 серпня, у неділю відбулося Богослужіння у Лемківській церкві в Шевченківському Гаю, після нього – Лемківське віче, а також продовжилися виступи лемківських художніх колективів. 
У 1999 р. Т.Старак подав заяву Президії, яка засідала у Ждині (Польща), з проханням увільнити його від обов\'язків голови СФУЛО за станом здоров\'я. Керівництво Федерації перебрав на себе відповідальний секретар проф. Іван Щерба зі Львова. ', 2),
	('III-й Конґрес СФУЛО  (17-19 травня 2002 р.)', 'Відбувся у Києві в Українському Домі та „Експоцентрі України”. Він зібрав 42 делегати із шести країн: у Федерацію вступив Союз Русинів Хорватії та Югославії. На відкритті співала хорова капела „Лемковина” зі Львова. Форум лемків відкрив проф. Іван Щерба – відповідальний секретар СФУЛО, який зачитав вітання від почесного голови Федерації проф. Івана Гвозди (США). Були зачитані вітання від Президента України, благословення від кардинала Л.Гузара (УГКЦ), владики Філарета (УПЦ). Засідання вели почергово М. Горбаль, І.Щерба, М.Дупляк, А.Тавпаш. З коротким звітом виступив в.о. голови Олександр Маслей (Польща). Зі співдоповідями виступили заступники голови Марія Дупляк (США) і Стефан Гладик (Польща). Звіти склали скарбник Володимир Ардан і голова Контрольної Комісії Юліан Френчко (Україна). Доповідали голови об\'єднань – суб”єктів Федерації. Делегатів і гостей вітали Президент УВАН акад. Олекса Біланюк зі США, голова Товариства українців „Славутич” у Москві проф. Василь Антонів, голови Всеукраїнських товариств - Олександр Боровик („Холмщина”) і Любомир Сікора („Бойківщина”), Затверджена Програма етнічного відродження Лемківщини. У науковій частині Конґресу з доповідями виступали д-р Євген Сверстюк (Київ) акад. Микола Мушинка (Пряшів), д-р. Олекса Мишанич (Київ). 
Головою СФУЛО обрано проф. Івана Щербу зі Львова. Заступниками голови стали Марія Дупляк – на Америку і Стефан Гладик – на Європу. Відповідальним секретарем обрана Стелла Миронченко (Київ). На пропозицію Номінаційної комісії обрано 28 членів Президії СФУЛО (крім голови і двох заступників) та сім членів Контрольної Комісії. Головою КК залишився Юліан Френчко, скарбником – Володимир Ардан (Львів). Делегати одностайно прийняли Ухвалу і Резолюцію Конгресу, Звернення до Верховної Ради України про прийняття Закону про надання статусу депортованим особам та членам їх родин, Звернення до Сейму Республіки Польща про засудження акції „Вісла”. Із заключним словом і підсумками роботи Конґресу виступив голова СФУЛО проф. Іван Щерба. 
19 травня на майдані Незалежности пройшов святковий концерт лемківських колективів та окремих виконавців.', 2),
	('ІV-й Конґрес СФУЛО  (4-6 травня 2007 р.)', 'Проходив у Львові  і співпав із 60-річницею акції „Вісла”. 4 травня у Західному Науковому Центрі проводилося засідання Президії і Контрольної Комісії СФУЛО з участю запрошених. Засідання вів проф. Іван Щерба – голова СФУЛО, який доповів про організацію і проведення Конґресу. Відбулося попереднє слухання фінансового звіту. Жваву дискусію викликало питання про зміни, доповнення і реєстрацію Статуту СФУЛО. Вирішено створити Статутну комісію і затвердити її склад на Конґресі. Проф. І.Щерба відмовився очолювати Федерацію на другу каденцію. Керівництво СФУЛО на прес-конференції дало відповіді представникам засобів масової інформації про поточні справи і проблеми лемків. Відтак, у Галереї мистецтв відкрито виставку лемківських професійних мистців, різьбярів, народних майстрів, художників-аматорів і фотографів. На виставці були присутні делегати Конґресу, автори праць, гості та краяни. 
Наступного дня, 5 травня Конґрес урочисто відкрито в обласній філармонії імені С.Людкевича. Лемків світу представляли 72 делегати зі семи країн та близько 400 гостей.На відкритті хор і оркестр вперше виконали кантату „Гори наши” М.Скорика. Були благословення священиків і вітання від владик. Присутні переглянули фільм про Лемківщину. Звіт про роботу Голови СФУЛО за період 2002-2007 рр. проходив нетрадиційно: на екрані висвічувалися тексти і фото, а Іван Щерба давав усний коментар. Були привітання офіційних представників влади та гостей. Відтак, присутні прослухали звіти-доповіді заступників голови Марії Дупляк (США) і Стефана Гладика (Польща), голів суб”єктів Федерації (С.Бурда, О.Венгринович, З.Галькович, І.Лаба, А.Родко, С.Сакач). Звіти склали фінансовий референт і скарбник. У роботі Конґресу взяли участь Віце-міністр культури України проф. Ольга Бенч, голова Всесвітньої Координаційної Ради, поет Дмитро Павличко. У науковій частині зібрання обговорювалися і засуджувалися трагічні наслідки акції „Вісла” (1947 р.). В новій редакції прийнято Статут СФУЛО. 
Номінаційна комісія внесла пропозицію обрати головою СФУЛО одного з трьох представників від України. Оскільки перші двоє (І.Щерба, О.Венгринович) відкликали свої кандидатури, Головою СФУЛО обрано доц.Володимира Ропецького зі Львова. Заступниками голови cтали Марія Дупляк – на Американський континент, Стефан Клапик – на Європу. Членом Президії і відповідальним секретарем обрано доц. Ігоря Дуду (Тернопіль), скарбником – Лілію Плахтій (Львів), фінансовим референтом – Івана Філя (США). Членами Президії СФУЛО на наступний термін обрані по п”ять кандидатур від кожного об\'єднання – суб\'єкта Федерації і по одній – в Контрольну Комісію. Головою КК. став доц. Степан Криницький (Івано-Франківськ). Прийнято Резолюцію і Звернення до Президентів України, Польщі і Словаччини, Організації Об\'єднаних Націй і Ради Європи. Із заключним словом і підсумками роботи ІУ. Конґресу виступив новообраний голова доц. Володимир Ропецький. 
6 травня, у неділю делегати та гості побували на Службі Божій в церкві свв. Ольги та Володимира у Шевченківському Гаю. Після обіду, протягом трьох годин у драматичному театрі імені М.Заньковецької проходив „Лемківський Кєрмеш” – фестиваль пісні і танцю. Виступали мистецькі колективи та окремі виконавці з Львівщини, Прикарпаття і Тернопільщини. 
Листом від 7.02.2011 р. доц. Володимир Ропецький склав зі себе повноваження Голови СФУЛО і передав їх Стефанові Клапику (Польща) – заступнику на Європу. Президія доручила виконувати обов”язки Голови СФУЛО до наступного конґресу Івану Лабі (Словаччина).', 2),
	('V-й Конґрес СФУЛО  (12-13 травня 2012 р.)', '<img src=\"/Images/Congresses/V/V_Congress.png\" width=\"100%\" >Проходив у м. Горлиці, Польща у рамках відзначення 65-роковин акції «Вісла». Лейтмотивом зібрання були слова Б. І. Антонича «До тебе, Батьківщино – земле вічна, ведуть усі стежки, усі дороги». 
Напередодні Конґресу, 11 травня в Центрі культури імені Б. І. Антонича проводилася Між-народна наукова конференція «Карпатський реґіон: історія, мова, культура», організована Науковим гуртком україністів Яґеллонського Університету та Об’єднанням Лемків Польщі. В конференції взяли участь 26 науковців з Польщі, України і Словаччини. Зацікавленість, зокрема, викликала доповідь Софії Федини зі Львова «Бути Лемком» – феномен збереження свого «я»: історія, культура, ідентичність». Там же діяла документальна виставка «Поляки –Українці. 1939-1947» із матеріалів Інституту Національної пам’яті у Любліні. 
Протягом двох з половиною годин у будинку «Двір Карваціанів» під проводом в.о. Голови СФУЛО Івана Лаби проходило останнє засідання Президії. На ньому були присутні 19 членів Президії, 2 – Контрольної Комісії та 9 запрошених. Обговорювалися організацій-ні питання Конґресу, уточнювалися окремі пункти проекту Статуту. Члени Президії остаточно визначилися про назву керівного органу як «Президія», а вибори Голови СФУЛО проводити на Конґресі: 14 осіб проголосували «за», 5 – «проти». На просьбу делегації США введена одна додаткова кандидатура члена Президії як заступника Голови на Америку. Пропозицію підтримали 17 осіб. 
<img src=\"/Images/Congresses/V/V-Prezydija.jpg\" width=\"310px\" align=\"right\" title=\"Президія V-го Конресу СФУЛО\">12 травня о 10-ій год. у «Дворі Карваціанів» зібрання почали зі спільної молитви, яку промовляв о. Іван Піпка з Криниці. В. о. Голови СФУЛО Іван Лаба (Словаччина) оголосив про присутніх делегатів, назвав іменитих гостей з Польщі та з-за кордону, наявність преси і відкрив Конґрес. Головуючий Стефан Гладик – голова Об’єднання Лемків Польщі, запропонував вшанувати хвилиною мовчання пам’ять невинних жертв акції «Вісла», зачитав Порядок денний і запросив за стіл робочої президії голів суб’єктів Федерації – Петра Сокола (Словаччина), Богдана Віславського (Сербія), Зенона Гальковича (США), Олександра Венгриновича (Україна), Адама Стеця (Канада). Представники від Хорватії відсутні через внутрішні причини. Сформовані робочі комісії – Статутна, Лічильна, Номінаційна, Резолюційна, Мандатна, Редакційна, в які увійшли по 3-4 делегати від шести держав. 
Іван Лаба у своєму звіті наголосив, що Конґрес приурочений до річниці акції «Вісла». Уряд Польщі повинен засудити цю акцію. Перекручення на ґрунті «політичного русинства». Лист до П. Маґочі. Питання поточної роботи Президії. Проведені засідання в Україні, Польщі, Хорватії, Сербії. Доопрацювання Статуту та необхідність його прийняття. Проблеми збереження етноґрафічної групи лемків. Піднесення рівня діяльности лемківських об’єднань. Робота ООЛ в Америці в обороні лемківських справ. Лемківські періодичні видання, друкована література, їх значення. Наукові видання Музею української культури в Свиднику, ФДЛ у Львові. Новітню історію Лемківщини пише М. Сополига. Наукові конференції в Ужгороді, Свиднику, Львові, Руському Керестурі, Львові, Горлицях. Святкування 100-літнього ювілею Б. І. Антонича. Результати масових заходівфестивалей: «Лемківська Ватра» в Ждині, Монастириську, Свиднику, які приваблюють до себе молодь. Мистецькі виставки художників-професіоналів і народних майстрів. Зосередження уваги на потреби молоді. Позитивна діяльність молодіжної ор-ганізації у Львові. Нам бракує молодих провідників-лідерів. Дух українства допоміг протистояти асиміляції.У цій благородній справі є місце для кожного лемка. 
<img src=\"/Images/Congresses/V/V-KontrolnaKomisija.jpg\" width=\"250px\" align=\"right\" title=\"Члени Контрольної Комісії СФУЛО\">Зі звітом Контрольної Комісії виступив її голова Степан Криницький з Івано-Франківська. Складність звітування. Голова СФУЛО достроково склав свої повноваження. Фінансова та організаційна діяльність складена на основі подань Л. Плахтій – скарбника, та І. Дуди – відповідального секретаря. Місця і зміст про-ведених засідань Президії та Контрольної Комісії. Колишній голова мав намір замінити існуючу назву Федерації. Однак, наміри голови залишилися намірами. Проблеми протистояння у Львівській обласній організації, лемки якої поділилися на дві частини. Проблеми з Київським товариством лемків. Цифри надходжень коштів та їх видатків. На пропозицію С. Гладика звіт Контрольної Комісії затверджений делегатами. 
Відтак промовляли гості Конгресу: Вітольд Кохан – бургомістр Горлиць, Василь Гривна – посол Словацької Республіки в Польщі (говорив українською мовою), Мирослав Вендриховіч – повітовий староста, Мирон Сич – голова Сей-мової Комісії в справах національних меншин (говорив по-українськи і по-польськи), Віталій Максименко – ґенеральний консул України в Кракові, Малґожата Малух – війт ґміни Сень-кова повіту Горлиці, Петро Тима – Голова Об’єднання Українців Польщі. 
Оголошено протоколи засідань Мандатної комісії, які озвучив Юрій Марканич: на Конґрес обрано 52 делегати, прибули – 46. Під час пів-годинної перерви проводилася прес-конференція із засобами масової інформації. 
З інформацією про зміни і доповнення до Статуту СФУЛО виступив Олександр Венгринович. За прийняття нового Статуту проголосували 29 делегатів. 
Звіти голів крайових організацій – суб’єктів Федерації, розпочав Стефан Гладик (Польща). Біжуча інформацію про діяльність Об’єднання Лемків. Проблеми державного фінансування. Всього встановлено 8 двомовних пам’ятних таблиць на Лемківщині, в т.ч. у Білянці. Пам’ятаємо не лише акцію «Вісла», але й Першу світову війну, в’язнів Талєрґофу. «Вражливість історична» вимагає від нас не ставити «дражливих» пам’ятників, наголосив доповідач. 
Адам Стець (Канада). Ми – українська діяспора, що налічує близько 1 млн. людей. Вже проводимо 27-му Лемківську Ватру в Канаді, яку започаткував Фецьо Ґоч. Основна проблема – асиміляція. Велика розпорошеність лемків в країні. Люди належать до різних українських орґанізацій. Лемківська громада залишилася і діє, пропали «Бойківщина» і «Гуцульщина». 
<img src=\"/Images/Congresses/V/V-Vengrynovych.jpg\" width=\"160px\" align=\"right\" title=\"Виступає О. Венгринович – голова ВУТЛ\">Олександр Венгринович (Україна). Необхідно терміново легалізувати Федерацію, створити молодіжну організацію. В Україні 20 обласних товариств, найбільше – в трьох західних областях. «Маємо право мати право» на повернення на свою землю. Депортація – це ґеноцид. Ніхто не вибачився за наші кривди. Лемки поставлені на межу зникнення. Найбільше досягнень маємо в галузі лемківської культури: Всеукраїнський фестиваль у Монастириську, 9 реґіональних фестивалів, виставка-конкурс лемківської писанки, відзначення 100-річчя Б. І. Антонича. Видано «Лемківський словник. 26 000 слів» І.Дуди. 
Зенон Галькович (США) сказав: «Ми самі себе фінансуємо». Видаємо масу книжок українською мовою. Ідею молоді ми занедбали. Наші діти спілкуються англійською мовою. Над веб-сторінкою працює А. Хомик. За депортацію польський уряд має покаятися, а ми їм вибачимо. Бажаю дружньої праці в лемківських справах. 
Після 45-хвилинної перерви на обід, звіти голів крайових орґанізацій продовжив Богдан Віславський (Сербія). Він сказав: маємо добру співпрацю з орґанізаціями України і Словаччини в справах фестивалей. У 2009 р. в Руському Керестурі проводилося засідання Президії СФУЛО, в якому взяло участь 14 членів з п’яти країн. 
В обговоренні доповідей-дискусіях виступили Василь Мулеса, Софія Федина, Лідія Плахтій та Юліан Френчко з України, д-р Мирослав Сополига і акад. Микола Мушинка зі Словаччини, Петро Вірхнянський з Гладишова (Польща)
Номінаційна комісія (голова Петро Сокол) встановила остаточні дані про кількість делегатів Конґресу з правом голосу: Словаччина – 8, Польща – 8, Сербія – 8, Україна – 11, Канада – 3, США – 8. Всього 46 делегатів. Вирішено, що Президія складатиметься з 17, Контрольна Комісія – 7 осіб. Кількість затверджена на засі-данні Президії СФУЛО, а персональний склад узгоджені з головами суб’єктів Федерації. Стефан Гладик проінформував, що два члени Президії та один до Контрольної Комісії будуть кооптовані від відсутньої на зібранні Хорватії. 
<img src=\"/Images/Congresses/V/V_SofijaFedyna.jpg\" width=\"150px\" align=\"right\" title=\"Софія Федина – голова СФУЛО\">На пост Голови СФУЛО висунуто три кандидатури: С. Федина (Україна), П. Сокол (Словаччина), С. Криницький (Україна). Кожний кандидат виступив із програмою діяльності, ділився своїм баченням на перспективу, відповідав на запитання присутніх. Результати таємного голосування показали: Софія Федина набрала 26 голосів, Степан Криницький – 12, Петро Сокол – 8. Таким чином, новим Головою СФУЛО стала Софія Федина – політолог, кандидат політичних наук, викладачка кафедри міжнародних відносин і дипломатичної служби Львівського Національного університету імені І. Франка, відома співачка. 
Делегати та учасники V. Конґресу СФУЛО прийняли Ухвалу і Звернення до Сейму, Президента та Уряду Польщі, до Президента, Кабінету Міністрів і Верховної Ради України, які зачитав Ігор Дуда. 
Новообрана Президія і Контрольна Комісія СФУЛО провели свої перші засідання. Заступниками Голови стали Адам Стець (Канада) на Америку і Стефан Гладик (Польща) на Європу. Відповідальним секретарем обрано доц. Степана Криницького (Україна), головою Контрольної Комісії – доц. Ігоря Дуду (Україна). Голова, члени Президії і Контрольної Комісії зробили спільні пам’ятні знімки. 
Після закриття Конґресу проводилася невелика концертна програма. Виступав 10-особовий хор «Зоря» з Устя-Горлицького (кер. Анна Дубец), який акапельно співав українські та лемківські народні пісні. Музично-поетичну композицію, присвячену творчости Б. І. Антонича, виконала актриса Евеліна Гвать з Ряшева. Три лемківські пісні заспівала Софія Федина. Лідія Плахтій прочитала власний вірш про Лемківщину. 
Наступного дня, 13 травня у неділю відбувалися Літургії в церкві Св.Трійці та монастирі СС. Василіянок, у яких взяли участь делегати і гості Конґресу, який відійшов в історію.
відей-дискусіях виступили Василь Мулеса, Софія Федина, Лідія Плахтій та Юліан Френчко з України, д-р Мирослав Сополига і акад. Микола Мушинка зі Словаччини, Петро Вірхнянський з Гладишова (Польща). 
Еміль Гойсак зачитав вітання учасникам Конґресу від проф. Ольги Бенч – ґенерального консула України в Пряшеві (Словаччина), Славка Бурди – колишнього голови Союзу Русинів-Українців Хорватії.', 2);";

mysql_query($query, $connection);

CloseConnection();


?>
